CSI API ETABS v1
cLoadCases.Count Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int Count(
	eLoadCaseType CaseType =
)
Function Count (
	Optional CaseType As eLoadCaseType =
) As Integer
Dim instance As cLoadCases
Dim CaseType As eLoadCaseType
Dim returnValue As Integer
returnValue = instance.Count(CaseType)
int Count(
	eLoadCaseType CaseType =
)
abstract Count :
        ?CaseType : eLoadCaseType
(* Defaults:
        let _CaseType = defaultArg CaseType
*)
-> int
Parameters
CaseType (Optional)
Type: ETABSv1.eLoadCaseType
Return Value
Type: Int32
See Also
Reference
cLoadCases Interface
ETABSv1 Namespace